
** Script.py

#+begin_src python :results output
  import pandas as pd

  manhattan = pd.read_csv("manhattan.csv")
  manhattan = manhattan[['rental_id', 'rent', 'min_to_subway', 'neighborhood', 'borough']]

  print(manhattan.head(10))


#+end_src

#+RESULTS:
#+begin_example
   rental_id   rent  min_to_subway       neighborhood    borough
0       1545   2550              9    Upper East Side  Manhattan
1       2472  11500              4  Greenwich Village  Manhattan
2       2919   4500              2            Midtown  Manhattan
3       2790   4795              3  Greenwich Village  Manhattan
4       3946  17500              3               Soho  Manhattan
5      10817   3800              3     Central Harlem  Manhattan
6       9077   1995              6       Midtown East  Manhattan
7       5150   2995              6  Battery Park City  Manhattan
8       9507  15000              0           Flatiron  Manhattan
9       1437   4650              5    Upper East Side  Manhattan
#+end_example

** Script.py

#+begin_src python :results output
import seaborn
import pandas as pd
from sklearn.model_selection import train_test_split

streeteasy = pd.read_csv("https://raw.githubusercontent.com/sonnynomnom/Codecademy-Machine-Learning-Fundamentals/master/StreetEasy/manhattan.csv")

df = pd.DataFrame(streeteasy)
x = df[['bedrooms', 'bathrooms', 'size_sqft', 'min_to_subway', 'floor', 'building_age_yrs', 'no_fee', 'has_roofdeck', 'has_washer_dryer', 'has_doorman', 'has_elevator', 'has_dishwasher', 'has_patio', 'has_gym']]
y = df['rent']

x_train, x_test, y_train, y_test = train_test_split(x, y, train_size=0.8, test_size=0.2, random_state=6)

print(x_train.shape)
print(x_test.shape)

print(y_train.shape)
print(y_test.shape)


#+end_src

#+RESULTS:
: (2831, 14)
: (708, 14)
: (2831,)
: (708,)

** Script.py

#+begin_src python :results output
  import seaborn as sns
  import matplotlib.pyplot as plt
  import pandas as pd
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LinearRegression

  streeteasy = pd.read_csv("https://raw.githubusercontent.com/sonnynomnom/Codecademy-Machine-Learning-Fundamentals/master/StreetEasy/manhattan.csv")

  df = pd.DataFrame(streeteasy)

  x = df[['bedrooms', 'bathrooms', 'size_sqft', 'min_to_subway', 'floor', 'building_age_yrs', 'no_fee', 'has_roofdeck', 'has_washer_dryer', 'has_doorman', 'has_elevator', 'has_dishwasher', 'has_patio', 'has_gym']]

  y = df[['rent']]

  x_train, x_test, y_train, y_test = train_test_split(x, y, train_size = 0.8, test_size = 0.2, random_state=6)

  # Add the code here:
  mlr = LinearRegression()

  mlr.fit(x_train, y_train)

  y_predic = mlr.predict(x_test)

  # # Sonny doesn't have an elevator so the 11th item in the list is a 0
  sonny_apartment = [[1, 1, 620, 16, 1, 98, 1, 0, 1, 0, 0, 1, 1, 0]]

  predict = mlr.predict(sonny_apartment)

  print("Predicted rent: $%.2f" % predict)

#+end_src

#+RESULTS:
: Predicted rent: $2393.58

** Script.py

#+begin_src python :results output
  import seaborn as sns
  import matplotlib.pyplot as plt
  import pandas as pd
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LinearRegression

  streeteasy = pd.read_csv("https://raw.githubusercontent.com/sonnynomnom/Codecademy-Machine-Learning-Fundamentals/master/StreetEasy/manhattan.csv")

  df = pd.DataFrame(streeteasy)

  x = df[['bedrooms', 'bathrooms', 'size_sqft', 'min_to_subway', 'floor', 'building_age_yrs', 'no_fee', 'has_roofdeck', 'has_washer_dryer', 'has_doorman', 'has_elevator', 'has_dishwasher', 'has_patio', 'has_gym']]

  y = df['rent']

  x_train, x_test, y_train, y_test = train_test_split(x, y, train_size=0.8, test_size=0.2, random_state=6)

  mlr = LinearRegression()

  model = mlr.fit(x_train, y_train)

  y_predict = mlr.predict(x_test)

  # Print out the coefficients
  print(mlr.coef_)

#+end_src

#+RESULTS:
: [-302.73009383 1199.3859951     4.79976742  -24.28993151   24.19824177
:    -7.58272473 -140.90664773   48.85017415  191.4257324  -151.11453388
:    89.408889    -57.89714551  -19.31948556  -38.92369828]

** Script.py

#+begin_src python :results output
  import seaborn as sns
  import matplotlib.pyplot as plt
  import pandas as pd
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LinearRegression

  streeteasy = pd.read_csv("https://raw.githubusercontent.com/sonnynomnom/Codecademy-Machine-Learning-Fundamentals/master/StreetEasy/manhattan.csv")

  df = pd.DataFrame(streeteasy)

  x = df[['bedrooms', 'bathrooms', 'size_sqft', 'min_to_subway', 'floor', 'building_age_yrs', 'no_fee', 'has_roofdeck', 'has_washer_dryer', 'has_doorman', 'has_elevator', 'has_dishwasher', 'has_patio', 'has_gym']]

  y = df[['rent']]

  x_train, x_test, y_train, y_test = train_test_split(x, y, train_size=0.8, test_size=0.20, random_state=6)

  mlr = LinearRegression()

  model = mlr.fit(x_train, y_train)

  y_predict = mlr.predict(x_test)

  print("Train score:")
  print(mlr.score(x_train, y_train))

  print("Test score:")
  print(mlr.score(x_test, y_test))

#+end_src

#+RESULTS:
: Train score:
: 0.7725460559817883
: Test score:
: 0.805037197535768

** Script.py

#+begin_src python :results output
  import seaborn as sns
  import matplotlib.pyplot as plt
  import pandas as pd

  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LinearRegression
  from sklearn.metrics import mean_squared_error

  streeteasy = pd.read_csv("https://raw.githubusercontent.com/sonnynomnom/Codecademy-Machine-Learning-Fundamentals/master/StreetEasy/manhattan.csv")

  df = pd.DataFrame(streeteasy)

  x = df[['bedrooms', 'bathrooms', 'size_sqft', 'min_to_subway', 'floor', 'building_age_yrs', 'no_fee', 'has_roofdeck', 'has_washer_dryer', 'has_doorman', 'has_elevator', 'has_dishwasher', 'has_patio', 'has_gym']]

  y = df[['rent']]

  x_train, x_test, y_train, y_test = train_test_split(x, y, train_size=0.8, test_size=0.2, random_state=6)

  lm = LinearRegression()

  model = lm.fit(x_train, y_train)

  y_predict = lm.predict(x_test)

  print("Train score:")
  print(lm.score(x_train, y_train))

  print("Test score:")
  print(lm.score(x_test, y_test))

  plt.scatter(y_test, y_predict)
  plt.plot(range(20000), range(20000))

  plt.xlabel("Prices: $Y_i$")
  plt.ylabel("Predicted prices: $\hat{Y}_i$")
  plt.title("Actual Rent vs Predicted Rent")

  plt.show()

#+end_src

#+RESULTS:
: Train score:
: 0.7725460559817883
: Test score:
: 0.805037197535768

